import { Repository } from '@/models';

export const repositories: Repository[] = [
  {
    id: 1,
    name: 'مخزن المحافظات الرئيسي',
    branch: 'بغداد',
  },
  {
    id: 2,
    name: 'أحمد مخزن البصرة',
    branch: 'البصرة',
  },
  {
    id: 3,
    name: 'مخزن الحلة',
    branch: 'الحلة',
  },
  {
    id: 4,
    name: 'مخزن بغداد الرئيسي',
    branch: 'بغداد',
  },
  {
    id: 5,
    name: 'محمد مخزن الكربلاء',
    branch: 'الكربلاء',
  },
  {
    id: 6,
    name: 'نور مخزن النجف',
    branch: 'النجف',
  },
  {
    id: 7,
    name: 'عباس مخزن الديوانية',
    branch: 'الديوانية',
  },
  {
    id: 8,
    name: 'ليلى مخزن الموصل',
    branch: 'الموصل',
  },
  {
    id: 9,
    name: 'زينب مخزن السليمانية',
    branch: 'السليمانية',
  },
  {
    id: 10,
    name: 'مصطفى مخزن الناصرية',
    branch: 'الناصرية',
  },
];

export const repositoriesBranches: string[] = [
  'فرع بغداد',
  'فرع البصرة',
  'فرع الحلة',
  'فرع الكربلاء',
  'فرع النجف',
  'فرع الديوانية',
  'فرع الموصل',
  'فرع السليمانية',
  'فرع الناصرية',
  'فرع دهوك',
];
